{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"output_shape": [90, 320, 3], "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0016\u0001\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "name": "lambda_1", "batch_input_shape": [null, 90, 320, 3], "arguments": {}, "dtype": "float32", "output_shape_type": "raw"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "strides": [4, 4], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "name": "conv2d_1", "kernel_regularizer": null, "kernel_size": [8, 8], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "filters": 16, "kernel_constraint": null, "padding": "same"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "name": "conv2d_2", "kernel_regularizer": null, "kernel_size": [5, 5], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "filters": 32, "kernel_constraint": null, "padding": "same"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "name": "conv2d_3", "kernel_regularizer": null, "kernel_size": [5, 5], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "filters": 64, "kernel_constraint": null, "padding": "same"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.2, "name": "dropout_1", "trainable": true, "noise_shape": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "name": "dense_1", "kernel_regularizer": null, "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "units": 512}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.5, "name": "dropout_2", "trainable": true, "noise_shape": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "name": "dense_2", "kernel_regularizer": null, "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "units": 1}}], "backend": "tensorflow", "keras_version": "2.0.9"}